# Exercise questions:

In [1]:
import pandas as pd # 1 summary of transaction
df=pd.read_csv("transactions.csv")
print(df)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [2]:
#2. Print Numbers of Attributes
import pandas as pd

df = pd.read_csv("transactions.csv")

print(df)

print("Number of attributes (columns):", len(df.columns))
print(df.shape[1])

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4
Number of attributes (columns): 5
5

In [23]:
#3. Print Numbers of Records
import pandas as pd

df = pd.read_csv("transactions.csv")

print(df)

print("Number of attributes (columns):", len(df))
print(df.shape[0])

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4
Number of attributes (columns): 10
10

In [24]:
#4 Get the row names
import pandas as pd

# Reading the CSV file into a DataFrame
df = pd.read_csv("transactions.csv")

# Printing the DataFrame
print(df)

# Getting and printing the row names (indices)
print("Row names (indices):", df.index.tolist())

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4
Row names (indices): [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [25]:
#5 Get the column names
import pandas as pd

df = pd.read_csv("transactions.csv")

print(df)

print("Column names:", df.columns.tolist())

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4
Column names: ['TransactionID', 'TransactionDate', 'UserID', 'ProductID', 'Quantity']

In [26]:
# 6 View top 10 Records
print(df.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [27]:
#.7 8 Change the name of columns ProductID and UserID
df.rename(columns={"ProductID": "ItemID"}, inplace=True)
print(df)

   TransactionID TransactionDate  UserID  ItemID  Quantity
0              1      2010-08-21     7.0       2         1
1              2      2011-05-26     3.0       4         1
2              3      2011-06-16     3.0       3         1
3              4      2012-08-26     1.0       2         3
4              5      2013-06-06     2.0       4         1
5              6      2013-12-23     2.0       5         6
6              7      2013-12-30     3.0       4         1
7              8      2014-04-24     NaN       2         3
8              9      2015-04-24     7.0       4         3
9             10      2016-05-08     3.0       4         4

In [14]:
#9 Order the rows of transactions by TransactionId descending, if ascending then ascending=True


df_ascending = df.sort_values(by="TransactionID", ascending=True)

print(df_ascending)

   TransactionID TransactionDate  UserID  ItemID  Quantity
0              1      2010-08-21     7.0       2         1
1              2      2011-05-26     3.0       4         1
2              3      2011-06-16     3.0       3         1
3              4      2012-08-26     1.0       2         3
4              5      2013-06-06     2.0       4         1
5              6      2013-12-23     2.0       5         6
6              7      2013-12-30     3.0       4         1
7              8      2014-04-24     NaN       2         3
8              9      2015-04-24     7.0       4         3
9             10      2016-05-08     3.0       4         4

In [28]:
#10 10. Order the rows of transactions by Quantity ascending, TransactionDate descending
df_ascending = df.sort_values(by="TransactionID", ascending=False)
print(df_ascending )

   TransactionID TransactionDate  UserID  ItemID  Quantity
9             10      2016-05-08     3.0       4         4
8              9      2015-04-24     7.0       4         3
7              8      2014-04-24     NaN       2         3
6              7      2013-12-30     3.0       4         1
5              6      2013-12-23     2.0       5         6
4              5      2013-06-06     2.0       4         1
3              4      2012-08-26     1.0       2         3
2              3      2011-06-16     3.0       3         1
1              2      2011-05-26     3.0       4         1
0              1      2010-08-21     7.0       2         1

In [30]:

df_ascending = df.sort_values(by=["Quantity","TransactionDate"], ascending=[True,False])

print(df_ascending )

   TransactionID TransactionDate  UserID  ItemID  Quantity
6              7      2013-12-30     3.0       4         1
4              5      2013-06-06     2.0       4         1
2              3      2011-06-16     3.0       3         1
1              2      2011-05-26     3.0       4         1
0              1      2010-08-21     7.0       2         1
8              9      2015-04-24     7.0       4         3
7              8      2014-04-24     NaN       2         3
3              4      2012-08-26     1.0       2         3
9             10      2016-05-08     3.0       4         4
5              6      2013-12-23     2.0       5         6

In [17]:
#11 ItemID", "Quantity", "TransactionDate", "TransactionID", "UserID"

df = df[["ItemID", "Quantity", "TransactionDate", "TransactionID", "UserID"]]

# Printing the updated DataFrame
print(df)

   ItemID  Quantity TransactionDate  TransactionID  UserID
0       2         1      2010-08-21              1     7.0
1       4         1      2011-05-26              2     3.0
2       3         1      2011-06-16              3     3.0
3       2         3      2012-08-26              4     1.0
4       4         1      2013-06-06              5     2.0
5       5         6      2013-12-23              6     2.0
6       4         1      2013-12-30              7     3.0
7       2         3      2014-04-24              8     NaN
8       4         3      2015-04-24              9     7.0
9       4         4      2016-05-08             10     3.0

In [40]:
#12 Make UserID the first column of transactions
df = df[["UserID","ItemID", "Quantity", "TransactionDate", "TransactionID"]]

# Printing the updated DataFrame
print(df)

   UserID  ItemID  Quantity TransactionDate  TransactionID
0     7.0       2         1      2010-08-21              1
1     3.0       4         1      2011-05-26              2
2     3.0       3         1      2011-06-16              3
3     1.0       2         3      2012-08-26              4
4     2.0       4         1      2013-06-06              5
5     2.0       5         6      2013-12-23              6
6     3.0       4         1      2013-12-30              7
7     NaN       2         3      2014-04-24              8
8     7.0       4         3      2015-04-24              9
9     3.0       4         4      2016-05-08             10

In [41]:
second_column = df.iloc[:, 1]
print(second_column)

0    2
1    4
2    3
3    2
4    4
5    5
6    4
7    2
8    4
9    4
Name: ItemID, dtype: int64

In [42]:
#13 Extracting arrays from a Data Frame. Get the 2nd column
second_column_array = df.iloc[:, 1].to_numpy()
print(second_column_array)

[2 4 3 2 4 5 4 2 4 4]

In [44]:
#14 Get the ProductID Array
second_column_array = df["ItemID"].to_numpy()
print(second_column_array)

[2 4 3 2 4 5 4 2 4 4]

In [45]:
#16 Row subsetting, subset rows 1,3 and 6
subset_rows = df.iloc[[1, 3, 6]]

print(subset_rows)

   UserID  ItemID  Quantity TransactionDate  TransactionID
1     3.0       4         1      2011-05-26              2
3     1.0       2         3      2012-08-26              4
6     3.0       4         1      2013-12-30              7

In [18]:
#.17 subset rows excluding 1,3 and 6
subset_rows_excluding = df.drop([1, 3, 6])
print(subset_rows_excluding)

   ItemID  Quantity TransactionDate  TransactionID  UserID
0       2         1      2010-08-21              1     7.0
2       3         1      2011-06-16              3     3.0
4       4         1      2013-06-06              5     2.0
5       5         6      2013-12-23              6     2.0
7       2         3      2014-04-24              8     NaN
8       4         3      2015-04-24              9     7.0
9       4         4      2016-05-08             10     3.0

In [49]:
#18 subset first three rows
print(df.head(3))

   UserID  ItemID  Quantity TransactionDate  TransactionID
0     7.0       2         1      2010-08-21              1
1     3.0       4         1      2011-05-26              2
2     3.0       3         1      2011-06-16              3

In [50]:
#19. Subset the last 2 rows
df.tail(2)

   UserID  ItemID  Quantity TransactionDate  TransactionID
8     7.0       4         3      2015-04-24              9
9     3.0       4         4      2016-05-08             10

In [33]:
#20 exclude last two rows
d=df.drop(index=df.index[-2:])

d

   TransactionID TransactionDate  UserID  ItemID  Quantity
0              1      2010-08-21     7.0       2         1
1              2      2011-05-26     3.0       4         1
2              3      2011-06-16     3.0       3         1
3              4      2012-08-26     1.0       2         3
4              5      2013-06-06     2.0       4         1
5              6      2013-12-23     2.0       5         6
6              7      2013-12-30     3.0       4         1
7              8      2014-04-24     NaN       2         3

In [34]:
#21 exclude first 3 row
d=df.drop(index=df.index[:2])
d

   TransactionID TransactionDate  UserID  ItemID  Quantity
2              3      2011-06-16     3.0       3         1
3              4      2012-08-26     1.0       2         3
4              5      2013-06-06     2.0       4         1
5              6      2013-12-23     2.0       5         6
6              7      2013-12-30     3.0       4         1
7              8      2014-04-24     NaN       2         3
8              9      2015-04-24     7.0       4         3
9             10      2016-05-08     3.0       4         4

In [30]:
# Subset rows where Quantity>1
d=df[df['Quantity']>1]
d

   ItemID  Quantity TransactionDate  TransactionID  UserID
3       2         3      2012-08-26              4     1.0
5       5         6      2013-12-23              6     2.0
7       2         3      2014-04-24              8     NaN
8       4         3      2015-04-24              9     7.0
9       4         4      2016-05-08             10     3.0

In [36]:
#23. Subset rows where UserID=2
d=df[df['UserID']==1]
d

   ItemID  Quantity TransactionDate  TransactionID  UserID
3       2         3      2012-08-26              4     1.0

In [53]:
#24. Subset rows where Quantity>1 and UserID=2
 
d=df[(df['Quantity'] > 1) & (df['UserID'] == 2)]
d

   ItemID  Quantity TransactionDate  TransactionID  UserID
5       5         6      2013-12-23              6     2.0

In [59]:
#25. Subset rows where Quantity + UserID is >3
d=df[(df["Quantity"])+df['UserID']>6]
            
d

   ItemID  Quantity TransactionDate  TransactionID  UserID
0       2         1      2010-08-21              1     7.0
5       5         6      2013-12-23              6     2.0
8       4         3      2015-04-24              9     7.0
9       4         4      2016-05-08             10     3.0

In [35]:
#26. Subset rows where an external array, foo, is True
import pandas as pd
import numpy as np
df=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
foo=np.array([True,False,True,False])
d=df[foo]
d

   A  B
0  1  5
2  3  7

In [66]:
#27. Subset rows where an external array, bar, is positive
df=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
bar=np.array([1,-1,3,-2])
d=df[bar>0]
d

   A  B
0  1  5
2  3  7

In [71]:
#28. Subset rows where foo is TRUE or bar is negative
bar=np.array([1,-1,3,-2])
foo=np.array([True,True,False,False])
d=df[(bar<0) & foo]
d

   A  B
1  2  6

In [75]:
import pandas as pd
df = pd.read_csv('transactions.csv')
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [84]:
#30. Subset by columns 1 and 3
d=df.iloc[:,[0,2]]
d

   TransactionID  UserID
0              1     7.0
1              2     3.0
2              3     3.0
3              4     1.0
4              5     2.0
5              6     2.0
6              7     3.0
7              8     NaN
8              9     7.0
9             10     3.0

In [89]:
#Subset by columns TransactionID and TransactionDate
d=df[['TransactionID','TransactionDate']]

d

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [94]:
d=['TransactionID','TransactionDate']
a=df[d]
a

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [99]:
#Updating the column
df['Foo']=df['UserID']
print(df.head())

   TransactionID TransactionDate  UserID  ProductID  Quantity  Foo
0              1      2010-08-21     7.0          2         1  7.0
1              2      2011-05-26     3.0          4         1  3.0
2              3      2011-06-16     3.0          3         1  3.0
3              4      2012-08-26     1.0          2         3  1.0
4              5      2013-06-06     2.0          4         1  2.0

In [1]:
#update the rows
d=df.loc[len(df)]=[1,"20-10-12",8,2,3,9.0]
df

NameError: name 'df' is not defined

In [38]:
#remove the rows 
df = df[df['UserID'] != 8.0]
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [39]:
#36. Convert the TransactionDate column to type Date
import pandas as pd
df['TransactionDate']=pd.to_datetime(df['TransactionDate'])
print(df.dtypes)

TransactionID               int64
TransactionDate    datetime64[ns]
UserID                    float64
ProductID                   int64
Quantity                    int64
dtype: object

In [43]:
#32
import pandas as pd

# Load the CSV file
df = pd.read_csv("transactions.csv")

# Define your variable list of column names to keep
columns_to_keep = ['TransactionID', 'UserID'] # change as needed

# Subset the DataFrame using that list
subset_df = df[columns_to_keep]

# Display the result
print(subset_df)

   TransactionID  UserID
0              1     7.0
1              2     3.0
2              3     3.0
3              4     1.0
4              5     2.0
5              6     2.0
6              7     3.0
7              8     NaN
8              9     7.0
9             10     3.0

In [44]:
#37. Insert a new column, Foo=UserID+ProductID
df['Foo']=df['UserID']+df['ProductID']
df

   TransactionID TransactionDate  UserID  ProductID  Quantity   Foo
0              1      2010-08-21     7.0          2         1   9.0
1              2      2011-05-26     3.0          4         1   7.0
2              3      2011-06-16     3.0          3         1   6.0
3              4      2012-08-26     1.0          2         3   3.0
4              5      2013-06-06     2.0          4         1   6.0
5              6      2013-12-23     2.0          5         6   7.0
6              7      2013-12-30     3.0          4         1   7.0
7              8      2014-04-24     NaN          2         3   NaN
8              9      2015-04-24     7.0          4         3  11.0
9             10      2016-05-08     3.0          4         4   7.0